_Rarzrabotki/Rarus/USO2/Catalogs/СМ_СметноНормативныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_СметноНормативныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипКоэффициентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правообладатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_УровниБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Районы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТерриториальныйРайон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_СметноНормативныеБазы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

// функция возвращает СНБ по умолчанию
//
// Параметры:
//   Нет.
//
// Возвращаемое значение: 
//   Сметно-нормативная база (СправочникСсылка.СМ_СметноНормативныеБазы).
//
Функция ПолучитьПоУмолчанию() Экспорт		
	База = Справочники.СМ_СметноНормативныеБазы.Выбрать();
	
	Если База.Следующий() Тогда
		Возврат База.Ссылка;
	Иначе 
		Возврат Справочники.СМ_СметноНормативныеБазы.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

// функция возвращает СНБ по району
//
// Параметры:
//   ТерриториальныйРайон - СправочникСсылка.СМ_ТерриториальныеРайоны для отбора.
//
// Возвращаемое значение: 
//   Сметно-нормативная база (СправочникСсылка.СМ_СметноНормативныеБазы).
//
Функция ПолучитьПоРайону(ТерриториальныйРайон) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СМ_СметноНормативныеБазыРайоны.Ссылка
	|ИЗ
	|	Справочник.СМ_СметноНормативныеБазы.Районы КАК СМ_СметноНормативныеБазыРайоны
	|ГДЕ
	|	СМ_СметноНормативныеБазыРайоны.ТерриториальныйРайон = &ТерриториальныйРайон";
	
	Запрос.УстановитьПараметр("ТерриториальныйРайон", ТерриториальныйРайон.Ссылка);
	
	Результат = Запрос.Выполнить();
	База = Результат.Выбрать();
	
	Если База.Следующий() Тогда
		Возврат База.Ссылка;
	Иначе 
		Возврат ПолучитьПоУмолчанию();
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьБазуПоУмолчанию() Экспорт	
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	СМ_СметноНормативныеБазы.Ссылка
	                    |ИЗ
	                    |	Справочник.СМ_СметноНормативныеБазы КАК СМ_СметноНормативныеБазы
	                    |ГДЕ
	                    |	СМ_СметноНормативныеБазы.Ссылка <> ЗНАЧЕНИЕ(Справочник.СМ_СметноНормативныеБазы.ИндивидуальныеРасценки)
	                    |	И НЕ СМ_СметноНормативныеБазы.ПометкаУдаления");
	
	Результат=Запрос.Выполнить();
	Если  Результат.Пустой() Тогда
		Возврат  Справочники.СМ_СметноНормативныеБазы.ИндивидуальныеРасценки;
	КонецЕсли;
	
	Возврат Справочники.СМ_СметноНормативныеБазы.ПустаяСсылка();
	
	
КонецФункции

#КонецОбласти
